{ "__v" : 0, "_id" : { "$oid" : "53682d0dca5d35765c9f4252" }, "grateful1" : "My cat didn't die", "grateful2" : "I got a kernel up and running.", "grateful3" : "This website doen't blow too much.", "images" : [ "/images/uploads/xc0nradx_707520399410250118r.jpg", "/images/uploads/xc0nradx_512075399412032833r.jpg" ], "isExercise" : false, "isMeditate" : false, "isRAK" : false, "journal" : "I didn't do shit today!", "moodOfDay" : 4, "timestamp" : { "$date" : 1399336205250 }, "user" : { "$oid" : "5368885a95df4056dde36383" } }
{ "__v" : 0, "_id" : { "$oid" : "53682d0e52ec077b5ca0a74c" }, "grateful1" : "I'm grateful that I'm all moved into my my new place.", "grateful2" : "I got a kernel up and running!", "grateful3" : "I wrote a lot of this website!", "images" : [ "/images/uploads/xc0nradx_479070399357717856r.jpg", "/images/uploads/xc0nradx_463511399359034006r.jpg" ], "isExercise" : false, "isMeditate" : false, "isRAK" : false, "journal" : "I didn't wake up till like 11 or so, but I woke up, showered, then ate a footlong at subway. Bacon Ranch Melt, extra meat. Then went to Cafe Cyberia and got a carmel macchiato. read a bit from the art of software security assessment. Then made gff, a tool for finding globally write able files.\n\nHad a neat idea on the walk back from cafe cyberia, what if we combined google Project Tango with neurotransmitters to feel objects around us?\n\nCame back, drank some mike hards, built the kernel.\n\nWent back to cafe cyberia, had two more carmel macchiatos, built most of this website! Ran into Apsite and Nix. Apsite said he thought I'd get A-shred no problemo. Told me to email him and Booker.\n\nThere were two girls in the cafe who I caught looking at me every once in a while. Then they went outside to smoke, and they knocked on the glass and hid under the ledge so I wouldn't see them. At the time I was nervous, but now I kinda wish I went and talked to them.\n\nThe girl who was serving drinks earlier in the afternoon was pretty pretty.\n\nCame back to daryl's, watched game of thrones episode, and then added this beautiful bootstrap to the website.", "moodOfDay" : 9, "timestamp" : { "$date" : 1399336206345 }, "user" : { "$oid" : "5368885a95df4056dde36383" } }
{ "__v" : 0, "_id" : { "$oid" : "53682d0faf03a07e5c997130" }, "grateful1" : "I can now send snaps to each day!", "grateful2" : "I have 25 more days of peace.", "grateful3" : "That there exist pretty girls in the world =P", "images" : [ "/images/uploads/xc0nradx_479070399357717856r.jpg", "/images/uploads/xc0nradx_62975399423877837r.jpg" ], "isExercise" : true, "isMeditate" : true, "isRAK" : false, "journal" : "I got snapchat integration working! And it's only 2:30AM!\n\nI didn't work out today. And I'm kind of bummed about that. It's kind of been dragging on me all day. I should really just workout and get it over with.\n\nBut I woke up (little after noon), then I worked on lifetracker at daryl's, and then I went to cyberia and continued working on lifetracker. I fixed the user authenticawtion bug (I needed a mongo store for some reason), and I created user profiles, snap chats save to users, and you can create entries for a new day if a entry doesn't already exist.\n\nThen I headed back to Daryl's and grabbed some JJ on the way back. The final girl who handed me my two slim jims was pretty pretty. \n\nI got back, ate them and watched Office. Adam came back and was on his computer for a while. He was laughing at the Office, which I'm kind of impressed about, it's hard to get all the humor without being able to see it, and I didn't realize he was paying attention.\n\nI layed on the floor for awhile, adam left, and then I left for Cyberia. The pretty waitress girl was back, she's really short. And aparently married? She had a ring anyways. But some other girl took my seat so im sitting in the top loft area and there's another pretty girl in the corner who I'm pretty sure is checking me out every once in awhile.\n\nHopefully I'll get the website stable tonight and deploy.\n\nEdit, I did workout :D went jogging. Now my leg feels like shiat.", "moodOfDay" : 6, "timestamp" : { "$date" : 1399350570379 }, "user" : { "$oid" : "5368885a95df4056dde36383" } }
{ "__v" : 0, "_id" : { "$oid" : "536a6774eb8386fcd35042d5" }, "grateful1" : "I am grateful that I deployed this website today.", "grateful2" : "", "grateful3" : "", "images" : [ "/images/uploads/xc0nradx_667104399482219383r.jpg", "/images/uploads/xc0nradx_226987399482496292r.jpg", "/images/uploads/xc0nradx_620773399490429853r.jpg" ], "isExercise" : true, "isMeditate" : false, "isRAK" : true, "journal" : "This entry was created by a snapchat!\n\nI set my alarm for 6:30 this morning. But I didn't make it. I forgive myself. I'm working hard meow.\n\nI think today I'll make a Wireless LAN pwn tool. Maybe not (edit 4 hours later).\n\nI worked on LifeTracker for awhile today, then got some JJs and watched Office. \n\nI went for a swim today! So go me, I think a pretty gil was watching me swim, but I don't know.", "moodOfDay" : 7, "timestamp" : { "$date" : 1399435200000 }, "user" : { "$oid" : "5368885a95df4056dde36383" } }
{ "_id" : { "$oid" : "536a84f51ac0bb0000ecc20d" }, "moodOfDay" : 5, "isRAK" : false, "isMeditate" : false, "isExercise" : false, "images" : [], "grateful3" : "", "grateful2" : "", "grateful1" : "", "timestamp" : { "$date" : 1399435200000 }, "__v" : 0 }
{ "_id" : { "$oid" : "536a85101ac0bb0000ecc20e" }, "moodOfDay" : 5, "isRAK" : false, "isMeditate" : false, "isExercise" : false, "images" : [], "grateful3" : "", "grateful2" : "", "grateful1" : "", "timestamp" : { "$date" : 1399435200000 }, "__v" : 0 }
{ "_id" : { "$oid" : "536a852da342f80000d65a76" }, "moodOfDay" : 5, "isRAK" : false, "isMeditate" : false, "isExercise" : false, "images" : [], "grateful3" : "", "grateful2" : "", "grateful1" : "", "timestamp" : { "$date" : 1399435200000 }, "__v" : 0 }
{ "__v" : 0, "_id" : { "$oid" : "536a88f6ad2b5800004124c4" }, "grateful1" : "My cat didn't die", "grateful2" : "", "grateful3" : "", "images" : [], "isExercise" : false, "isMeditate" : false, "isRAK" : false, "moodOfDay" : 5, "timestamp" : { "$date" : 1399435200000 }, "user" : { "$oid" : "536a88f0ad2b5800004124c3" } }
